def map_city(city_name):
    """使用字典的get方法获取对应城市名的区划名称，如果该城市名不存在于字典中，则返回原城市名。"""
    city_dict = {
        "义乌": "义乌市",
        "台州": "台州市",
        "嘉兴": "嘉兴市",
        "宁波": "宁波市",
        "杭州": "杭州市",
        "滨江": "滨江区",
        "淳安": "淳安县",
        "富阳": "富阳区",
        "拱墅": "拱墅区",
        "建德": "建德市",
        "临安": "临安区",
        "上城": "上城区",
        "桐庐": "桐庐县",
        "萧山": "萧山区",
        "西湖": "西湖区",
        "余杭": "余杭区",
        "温州": "温州市",
        "湖州": "湖州市",
        "绍兴": "绍兴市",
        "衢州": "衢州市",
        "金华": "金华市"
    }
    return city_dict.get(city_name, city_name)